IDEA Open Model
CrossSectionThermalAttribute.Components Property
Compatible with IDEA StatiCa v 10.1
 List of components
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public List<CrossSectionComponentThermalData> Components { get; set; }
Public Property Components As List(Of CrossSectionComponentThermalData)
	Get
	Set
public:
property List<CrossSectionComponentThermalData^>^ Components {
	List<CrossSectionComponentThermalData^>^ get ();
	void set (List<CrossSectionComponentThermalData^>^ value);
}
Property Value
Type: List<CrossSectionComponentThermalData>
See Also
Reference
CrossSectionThermalAttribute Class
IdeaRS.OpenModel.CrossSection Namespace